
#russian_alphabet = ["а", "б", "в", "г", "д", "е", "ё", "ж", "з", "и", "й", "к", "л", "м",
                        #"н", "о", "п", "р", "с", "т", "у", "ф", "х", "ц", "ч", "ш", "щ", "ъ", "ы", "ь", "э", "ю", "я"]
russian_alphabet = ["у", "л", "к", "о", "м", "р", "ь", "я", "д", "б", "з", "е", "ё", "н",
                        "ы", "й", "а", "т", "ц", "п", "и", "ч", "ю", "в", "с", "х", "г", "ш", "ж", "щ"]

def count_letters(text):
    text_list = list(text)
    frequency_dict = {}
    for d in range(0, len(russian_alphabet), 1):
        frequency_dict[russian_alphabet[d]] = 1
    count = 0
    for i in russian_alphabet:
        for p in text_list:
            if p == i:
                count += 1
        frequency_dict[i] = count
        count = 0
    return frequency_dict

# TODO Напишите функцию calculate_frequency
def calculate_frequency(value_dict):
    final_dict = value_dict
    total = 0
    for i in russian_alphabet:
        total += value_dict.get(i) #количество букв
    for d in russian_alphabet:
        final_dict[d] /= total
    return final_dict

main_str = """
У лукоморья дуб зелёный;
Златая цепь на дубе том:
И днём и ночью кот учёный
Всё ходит по цепи кругом;
Идёт направо — песнь заводит,
Налево — сказку говорит.
Там чудеса: там леший бродит,
Русалка на ветвях сидит;
Там на неведомых дорожках
Следы невиданных зверей;
Избушка там на курьих ножках
Стоит без окон, без дверей;
Там лес и дол видений полны;
Там о заре прихлынут волны
На брег песчаный и пустой,
И тридцать витязей прекрасных
Чредой из вод выходят ясных,
И с ними дядька их морской;
Там королевич мимоходом
Пленяет грозного царя;
Там в облаках перед народом
Через леса, через моря
Колдун несёт богатыря;
В темнице там царевна тужит,
А бурый волк ей верно служит;
Там ступа с Бабою Ягой
Идёт, бредёт сама собой,
Там царь Кащей над златом чахнет;
Там русский дух… там Русью пахнет!
И там я был, и мёд я пил;
У моря видел дуб зелёный;
Под ним сидел, и кот учёный
Свои мне сказки говорил.
"""

# TODO Распечатайте в столбик букву и её частоту в тексте

print_dict = calculate_frequency(count_letters(main_str.lower()))
for it in russian_alphabet:
    print(f"{it}: {format(print_dict[it], '.2f' )}")